{
  "testimonials": [
    {
      "title": "Pastor Jenne & Evelien Hummel",
      "text": "Pastor Dan and his wife prophetess Quincy are very talented in what they teach. Driven and passionate. They see gold in people. But above all, they do it from God's Spirit and love; beautiful people.",
      "ministry": "The House of the Living Water@ city of Dronten in Holland (The church on the Boat)",
      "image": "/assets/images/testimonials/Jen.jpg"
    },
    {
      "title": "Apostle Simon & Prophetess Faith Khan",
      "text": "For a couple of years, we have known Pastor Davies and Prophetess Quincy, and we admire the special callings of God upon their lives. They are a couple with a clear vision, passion, an excellent spirit, charisma, and great zeal for the work of God.",
      "ministry": "End Time Harvester International Ministries, Belgium",
      "image": "/assets/images/testimonials/Khan.png"
    },
    {
      "title": "Prophets Donnefer and Angela",
      "text": "Pastor Dan and Prophetess Quince are passionately training the praise team, leading to both technical and spiritual growth. Their dedication to building the kingdom together is evident, and they are highly recommended for any ministry.",
      "ministry": "Kingdom Establishers, Almere Holland",
      "image": "/assets/images/testimonials/donnefer.jpg"
    },
    {
      "title": "Reverend Edmund Sackey Brown",
      "text": "Quincy Davies Ministry has been of a tremendous blessing and help to my wife and I and our entire ministry for several years. They have always provided us with the assistance we require whenever we call on them, with excellence and without hesitation. Minister Quincy’s stage presence is captivating. Her natural ability and passion to engage the audience and make them feel connected to her song ministration, both In worship or during a gospel concert is superb, powerful, dynamic, and captivating! Minister Dan is such a humble man, yet a gifted, talented, dedicated musician who executes his duties with great passion and precision. He is sold out to God and what he does as a musician. He is a musician with a high sense of spirituality and a great desire for the word of God, which is quite rare to find in our current day Post modern musicians and gospel artists. I duly endorse their ministry without any reservation!",
      "ministry": "Head Pastor - House of Solution Christ Church International, Muelhim an der Ruhr Germany",
      "image": "/assets/images/testimonials/Edmond.jpg"
    },
    {
      "title": "Apostle Kelly and Prophetess Sherma Oriakhi",
      "text": "Quincy Davies Ministries, led by Pastor Dan and Prophetess Quincy, greatly empowered our Praise and Worship team. We highly recommend them to individuals seeking musical training and churches aiming to elevate their Praise and Worship teams for enhanced musical stewardship.",
      "ministry": "The FULL STATURE OF CHRIST CHURCH, Worldwide, International (The Netherlands)",
      "image": "/assets/images/testimonials/Kelly.jpg"
    },
    {
      "title": "Pastor Marvin Wojtkowiak",
      "text": "The service of Quincy Davies Ministries has been a great enrichment for me, especially in the area of ​​worship. I was able to experience both street evangelism and a few worship evenings with them and am thrilled by both their professional know-how as musicians and the spiritual depth with which they serve and thus become a blessing. I'm already looking forward to the next events with Pastor Dan and Quincy!",
      "ministry": "Gospel Zentrum Essen von Frei Ev. Kirche Altendorf",
      "image": "/assets/images/testimonials/Marvin.jpg"
    },
    {
      "title": "Pastor Jesse M. Ayomah",
      "text": "Pastor Dan and Quincy's Ministry has blessed our church, uplifting us with spirit-filled performances and workshops. Their dedication has strengthened our music team, fostering confidence, unity, and spiritual growth. The workshops empowered members to take leadership roles, enhancing their contributions and strengthening the church overall.",
      "ministry": "All Nation Church , Düsseldorf Germany",
      "image": "/assets/images/testimonials/jesse.jpg"
    },
    {
      "title": "Daniel Sachs",
      "text": "It has been a privilege to get to know Dan and Quincy Davies. God clearly called them to serve God selflessly and sacrificially in the areas of greatest needs and the things closest to the heart of Jesus: worshipping God, marriage, helping the poor, and making disciples. I've witnessed them serve with great humility, in the kindness, love and wisdom that only God can give. Thank you for being a great example to everyone around you!",
      "ministry": "The Marriage School, Inc.",
      "image": "/assets/images/testimonials/marriage-school.jpg"
    },
    {
      "title": "Cheryl Porter Vocal Coach (USA)",
      "text": "Dan and Quincy are doing fantastic work as Ministers of the gospel. They have been a tremendous blessing ever since I first met Quincy",
      "ministry": "Cheryl Portal Method",
      "image": "/assets/images/testimonials/Cherry.jpg"
    },
    {
      "title": "Evangelist Daniel Schott",
      "text": "Amazing voice! Worship from the depths of her heart. What a gift to this world!",
      "ministry": "Global Evangelist Network (German)",
      "image": "/assets/images/testimonials/Scott.jpg"
    }
  ],
  "events": [
    {
      "id": 1,
      "images": ["/assets/images/events/university-of-marriage.jpg"],
      "title": "UNIVERSITY OF MARRIAGE",
      "text": "The University of Marriage is a non-profit marriage school part of Quincy Davies Ministries. It offers programs such as The Third Option to strengthen marriages and families, focusing on practical skills and inner growth. The volunteers follow a ministry philosophy based on Ephesians 4:12, being spiritually gifted, humble, and dedicated to personal development.It's in 4 seasons /semester; Spring ,Summer ,Autuum,Winter Class",
      "start": "6 September, 2024",
      "end": null,
      "frequency": "Friday",
      "time": "19:00 - 20:30"
    },
    {
      "id": 2,
      "images": ["/assets/images/love-letters.jpg"],
      "title": "LOVE LETTERS",
      "text": "Love letters is a part of the University of Marriage, providing prompt solutions for marital challenges. This program runs from August to December.",
      "start": "August",
      "end": "December",
      "frequency": "Weekly - Thursday",
      "time": "8pm to 10pm"
    },
    {
      "id": 3,
      "images": ["/assets/images/assiduous woman/AWD.jpg"],
      "title": "THE ASSIDUOUS WOMAN DAIRY",
      "text": "Our live broadcasts feature dedicated sessions on empowering women to embrace their roles as vital contributors to society, in line with their divine purpose. We aim to inspire and equip women to make history together",
      "start": "February",
      "end": "June",
      "frequency": "Weekly - Thursday",
      "time": "8pm to 10pm"
    },
    {
      "id": 3,
      "images": ["/assets/images/post.jpg"],
      "galleryImages": [
        "/assets/images/assiduous woman/IMG_20240426_193045.jpg",
        "/assets/images/assiduous woman/IMG_20240426_192508.jpg",
        "/assets/images/assiduous woman/IMG_20240426_193254.jpg"
      ],
      "title": "THE ASSIDUOUS WOMAN INTERNATIONAL CONFERENCE",
      "text": "The Assiduous Woman (TAW) Int is a divine vision that highlights women's role as helpers and contributors in society as intended by God. We aim to empower women and make history together.",
      "start": "February",
      "end": "June",
      "frequency": "Weekly - Thursday",
      "time": "8pm to 10pm"
    },
    {
      "id": 4,
      "images": ["/assets/images/street-worship.jpg"],
      "title": "STREET WORSHIP, EVANGELISM, AND WORSHIP NIGHT",
      "text": "Jesus didn't confine his presence to the synagogue; his kindness extended everywhere. Street worship serves as a platform where we can honor him openly and spread his message far and wide.",
      "start": null,
      "end": null,
      "frequency": "Last Saturday of the month",
      "time": "3pm"
    },
    {
      "id": 5,
      "images": ["/assets/images/worshippers-blueprint.jpg"],
      "title": "THE WORSHIPPER'S BLUEPRINT",
      "text": "Leading worship and musicianship in the gospel music world and church settings can be challenging, but it’s a skill that can be taught and learned at QDM. The Worshipper Blueprint program is designed not only to develop excellence in voice and musicianship but also to instill ministerial ethics, character, and integrity",
      "start": null,
      "end": null,
      "frequency": "Done Annually",
      "time": null
    }
  ],
  "eventDetails": "Event details",
  "seeMore": "See more",
  "services": [
    {
      "title": "Coaching and Training Sessions",
      "text": "Benefit from Quincy's wealth of experience in voice, having worked alongside Cheryl Porter. Davies also holds a music degree and offers extensive expertise. Your talent is well-cared for in our hands."
    },
    {
      "title": "Exclusive Collaboration and Outsourcing Opportunities",
      "text": "Enhance your music with our established music training programs, complemented by our studio's expert recording and production services."
    },
    {
      "title": "Sound System and Instruments",
      "text": "We have instruments for crusades, large-scale and small-scale events. Reinforce your events as we support you with musicians/band/sound & musical instruments."
    },
    {
      "title": "Christmas Moment with Quincy Bell and the Davies Gospellier",
      "text": "Celebrate the holiday season with our special Christmas Moments event. Reserve Quincy Bell & Davies Gospellier for your end-of-year festivities, including company parties, church celebrations, and Easter events."
    },
    {
      "title": "Quincy's Coner",
      "text": "Seek professional guidance and support through Quincy’s Coner, our counseling services. Quincy Bell is a certified psychotherapist and is available for sessions if you are dealing with grief or mental health concerns."
    }
  ],
  "heroSection": {
    "welcome": "Welcome to",
    "summary": "A Worship, Outreach, Helping, Itinery and Travel Ministry"
  },
  "homePageTitles": {
    "events": {
      "title": "Programmes",
      "text": "Special programmes and upcomming events"
    },
    "testimonials": {
      "title": "testimonials",
      "text": "What people think about us"
    },
    "christmas": {
      "title": "christmas",
      "text": "Christmas Moments with Quincy Bell and the Davies Gospellier",
      "description": " The Christmas Moment is a special occasion that takes place during the holiday season. Reserve our Christmas Moment with Quincy Bell & Davies Gospellier for your end-of-year events, including company parties,Christmas church celebrations, and Easter festival seasons.",
      "comment": "We will create a special Christmas Moment for you with our services.",
      "card": {
        "card1": {
          "title": "Sing for Joy",
          "text": "For God so loved the word that he gave."
        },
        "card2": {
          "title": "Celebrate the King of Kings",
          "text": "The very birth of our Lord is the greatest gift we were given."
        }
      },
      "link": "learn more"
    }
  },
  "support": {
    "title": "Pray! And listen to God! You can do this alone, but find somebody to do it with you",
    "text": "Help someone to find someone",
    "buttonText": "Support Us"
  },
  "navigation": {
    "home": "Home",
    "events": "Programmes",
    "services": "Services",
    "contactUs": "Contact us",
    "aboutUs": "About us",
    "about": "About",
    "aboutText": "Quincy Davies Ministries is dedicated to fostering spiritual connection through worship music. Led by Dan Davies Oduro and Quincy Bell Davies, we bring over two decades of experience in gospel and church music, inspiring and guiding worshipers in faith. Our mission is to bring hope, healing, and salvation through spirit-filled worship, uplifting communities and supporting the body of Christ with enduring solutions for impactful worship.",
    "supportUs": "Support Us",
    "newsLetter": {
      "title": "NewsLetter",
      "text": "Sign up for our weekly newsletter to stay updated on all news and events"
    },
    "footerInput": {
      "email": "Email",
      "buttonText": "Sign Up"
    },
    "quickLinks": "Quick Links"
  },
  "drawer": {
    "newsLetter": {
      "title": "Subscribe to our news letter",
      "description": "We'll keep you up to date with the latest developments in theministry",
      "placeholder": "Enter your email",
      "subscribeButtonText": "Subscribe",
      "cancelButtonText": "Cancel"
    },
    "learnMore": {
      "title": "Which service are you interested in?",
      "description": "Tell us what you wnat to know and we will let you know everything you need to know",
      "name": "Enter your name",
      "email": "Enter your email",
      "message": "Type your message here.",
      "service": "Select a service",
      "subscribeButtonText": "Subscribe",
      "cancelButtonText": "Cancel"
    }
  },
  "servicesPage": {
    "mainTitle": "The Services We Offer",
    "description": "",
    "buttonText": "Learn more"
  },
  "contactUsPage": {
    "location": "Our Location",
    "phoneNumber": "Phone Number",
    "email": "Email Address",
    "form": {
      "name": "Name",
      "email": "Email",
      "subject": "Subject",
      "message": "Type your message here.",
      "buttonText": "Submit"
    }
  },
  "aboutUsPage": {
    "title": "About us",
    "subTitle": "Spreading the Gospel of Jesus Christ  is our mandate and Participating rightly in worship is vital to our walk with God",
    "description": "The power of music in spiritual devotion has been profound throughout history. Unlike anything else on Earth, music transcends human creation—it originates from a higher realm, designed with a singular purpose: worship. It remains untouched by earthly manipulation, uniquely crafted from heavenly inspiration. At Quincy Davies Ministries, we are dedicated to fostering spiritual intimacy through worship. With over two decades of experience in gospel and church music, Dan Davies Oduro—a certified Bachelor of Arts in Music—and his wife, Quincy Bell Davies, serve as anointed vessels. They have passionately led congregations into the presence of God through music, ministering at numerous services, events, crusades, and conferences. Our mission is clear: to heal broken hearts, offer hope to the lost, and ultimately, save souls through our spirit-filled music and personal testimonies. As disciples of Jesus Christ, we evangelize through gospel worship leadership, directing, training, coaching, and teaching. We are committed to providing enduring solutions for effective worship music within the body of Christ today.",
    "teamTitle": "Our team",
    "scripture": " The name of the Lord is a strong tower; the righteous runs in and is saved.",
    "teamSubTitle": "The hands that hold us up"
  },
  "supportUsPage": {
    "campaign": "Our Campaign",
    "campaignTitle": "Arms of Hope",
    "campaignDescription": "In our steadfast pursuit of spreading the gospel, Quincy Davies Ministries (QDM) Foundation was established in 2019 with a heartfelt commitment to giving back to our community, especially the underprivileged in Africa, our beloved homeland. We are deeply passionate about providing vital assistance to families—widows, orphans, disabled children, and others—who struggle daily to meet their basic needs.",
    "quote": " And He (Jesus) took the children in His arms, placed His hands on them, and blessed them",
    "title": "Give to the cause of love",
    "subTitle": "Save Humanity, Save Life",
    "description": "Join us in spreading hope and changing lives. Your generosity will help us reach more families in need and make a lasting impact. Together, let&apos;s fulfill the mission of love and compassion that Jesus exemplified. Visit our website to donate or learn more about how you can partner with us in this meaningful cause. Thank you for considering supporting Quincy Davies Ministries (QDM) Foundation. Together, we can make a difference that resonates far beyond",
    "visions": {
      "first": "⁠We aim to ensure that the most impoverished communities have daily access to three nutritious meals.",
      "second": "⁠We strive to offer life-saving health support, particularly for vulnerable families such as widows and children.",
      "third": "⁠We are dedicated to sponsoring 5-10 students annually, enabling them to access full-time, quality education."
    },
    "endDescription": "Your support can make an immense difference in these initiatives. By contributing to Quincy Davies Ministries (QDM) Foundation, you join us in directly impacting lives and communities across Africa. Together, we can provide sustenance, healthcare, and educational opportunities that are crucial for the well-being and future of these deserving individuals. Your donation, no matter the size, will help us continue this vital work and bring hope and transformation where it is needed most. today."
  },
  "LocaleSwitcher": {
    "label": "Change language",
    "locale": "{locale, select, ge {🇩🇪 German} en {🇺🇸 English} other {Unknown}}"
  }
}
